//
//  ZSC_SecondVC.m
//  DearBlock
//
//  Created by nd_zsc on 16/8/19.
//  Copyright © 2016年 很傻很天真. All rights reserved.
//
/*
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 ♥︎♥︎ 　       ◆          ◆◆◆◆◆   ◆    ◆         ◆           ◆          ◆                       ◆          ◆  ◆       ♥︎♥︎
 ♥︎♥︎ 　 ◆◆◆   ◆    ◆◆◆◆◆◆       ◆     ◆         ◆      ◆     ◆          ◆                    ◆◆◆◆◆◆◆      ◆  ◆       ♥︎♥︎
 ♥︎♥︎ 　   ◆   ◆     ◆  ◆    ◆  ◆◆◆◆◆  ◆◆◆◆      ◆       ◆          ◆◆◆◆◆◆◆◆◆◆◆               ◆     ◆     ◆   ◆◆◆◆◆   ♥︎♥︎
 ♥︎♥︎ 　◆◆◆◆◆◆ ◆◆◆◆   ◆  ◆  ◆   ◆   ◆ ◆   ◆      ◆         ◆◆◆◆◆◆◆  ◆         ◆               ◆◆◆◆◆◆◆     ◆  ◆        ♥︎♥︎
 ♥︎♥︎ 　 ◆  ◆ ◆  ◆  ◆◆◆◆◆◆◆◆◆◆◆ ◆   ◆◆    ◆      ◆            ◆                               ◆     ◆    ◆◆ ◆  ◆      ♥︎♥︎
 ♥︎♥︎ 　 ◆◆◆◆◆ ◆ ◆  ◆   ◆     ◆     ◆  ◆  ◆     ◆ ◆     ◆     ◆     ◆◆◆◆◆◆◆◆◆◆◆               ◆◆◆◆◆◆◆ ◆ ◆ ◆    ◆      ♥︎♥︎
 ♥︎♥︎ 　 ◆  ◆  ◆ ◆   ◆◆◆◆◆◆◆◆◆  ◆◆◆◆◆   ◆ ◆     ◆ ◆      ◆    ◆          ◆      ◆◆◆◆◆◆◆◆◆◆◆   ◆     ◆◆    ◆  ◆◆◆◆◆◆   ♥︎♥︎
 ♥︎♥︎ 　 ◆◆◆◆  ◆ ◆     ◆        ◆   ◆   ◆ ◆    ◆   ◆       ◆◆◆◆◆◆◆    ◆  ◆                  ◆◆◆◆◆◆◆◆◆     ◆    ◆  ◆   ♥︎♥︎
 ♥︎♥︎ 　 ◆  ◆◆ ◆ ◆     ◆◆◆◆◆◆   ◆   ◆     ◆    ◆   ◆          ◆       ◆  ◆◆◆◆◆                   ◆◆ ◆     ◆   ◆   ◆   ♥︎♥︎
 ♥︎♥︎ 　◆◆◆◆◆   ◆     ◆ ◆   ◆   ◆   ◆     ◆   ◆     ◆    ◆    ◆       ◆  ◆                     ◆◆   ◆     ◆   ◆   ◆   ♥︎♥︎
 ♥︎♥︎ 　    ◆  ◆ ◆   ◆   ◆◆◆    ◆◆◆◆◆     ◆  ◆       ◆  ◆     ◆      ◆ ◆ ◆                  ◆◆◆     ◆     ◆  ◆    ◆   ♥︎♥︎
 ♥︎♥︎ 　    ◆ ◆   ◆ ◆ ◆◆◆   ◆◆◆ ◆   ◆   ◆◆  ◆         ◆   ◆◆◆◆◆◆◆◆◆ ◆   ◆◆◆◆◆◆◆                   ◆◆◆     ◆ ◆   ◆◆    ♥︎♥︎
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 */

#import "ZSC_SecondVC.h"

@implementation ZSC_SecondVC

- (void)viewDidLoad{
    self.view.backgroundColor = [UIColor orangeColor];
    if (self.DearBlock) {
        self.DearBlock(@"恩怨易了 柔情难抛");
    }
    
}

@end
