//
//  ZSC_SecondVC.h
//  DearBlock
//
//  Created by nd_zsc on 16/8/19.
//  Copyright © 2016年 很傻很天真. All rights reserved.
//
/*
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 ♥︎♥︎ 　       ◆          ◆◆◆◆◆   ◆    ◆         ◆           ◆          ◆                       ◆          ◆  ◆       ♥︎♥︎
 ♥︎♥︎ 　 ◆◆◆   ◆    ◆◆◆◆◆◆       ◆     ◆         ◆      ◆     ◆          ◆                    ◆◆◆◆◆◆◆      ◆  ◆       ♥︎♥︎
 ♥︎♥︎ 　   ◆   ◆     ◆  ◆    ◆  ◆◆◆◆◆  ◆◆◆◆      ◆       ◆          ◆◆◆◆◆◆◆◆◆◆◆               ◆     ◆     ◆   ◆◆◆◆◆   ♥︎♥︎
 ♥︎♥︎ 　◆◆◆◆◆◆ ◆◆◆◆   ◆  ◆  ◆   ◆   ◆ ◆   ◆      ◆         ◆◆◆◆◆◆◆  ◆         ◆               ◆◆◆◆◆◆◆     ◆  ◆        ♥︎♥︎
 ♥︎♥︎ 　 ◆  ◆ ◆  ◆  ◆◆◆◆◆◆◆◆◆◆◆ ◆   ◆◆    ◆      ◆            ◆                               ◆     ◆    ◆◆ ◆  ◆      ♥︎♥︎
 ♥︎♥︎ 　 ◆◆◆◆◆ ◆ ◆  ◆   ◆     ◆     ◆  ◆  ◆     ◆ ◆     ◆     ◆     ◆◆◆◆◆◆◆◆◆◆◆               ◆◆◆◆◆◆◆ ◆ ◆ ◆    ◆      ♥︎♥︎
 ♥︎♥︎ 　 ◆  ◆  ◆ ◆   ◆◆◆◆◆◆◆◆◆  ◆◆◆◆◆   ◆ ◆     ◆ ◆      ◆    ◆          ◆      ◆◆◆◆◆◆◆◆◆◆◆   ◆     ◆◆    ◆  ◆◆◆◆◆◆   ♥︎♥︎
 ♥︎♥︎ 　 ◆◆◆◆  ◆ ◆     ◆        ◆   ◆   ◆ ◆     ◆ ◆       ◆◆◆◆◆◆◆     ◆  ◆                  ◆◆◆◆◆◆◆◆◆     ◆    ◆  ◆   ♥︎♥︎
 ♥︎♥︎ 　 ◆  ◆◆ ◆ ◆     ◆◆◆◆◆◆   ◆   ◆     ◆    ◆   ◆          ◆       ◆  ◆◆◆◆◆                   ◆◆ ◆     ◆   ◆   ◆   ♥︎♥︎
 ♥︎♥︎ 　◆◆◆◆◆   ◆     ◆ ◆   ◆   ◆   ◆     ◆   ◆     ◆    ◆    ◆       ◆  ◆                     ◆◆   ◆     ◆   ◆   ◆   ♥︎♥︎
 ♥︎♥︎ 　    ◆  ◆ ◆   ◆   ◆◆◆    ◆◆◆◆◆     ◆  ◆       ◆  ◆     ◆      ◆ ◆ ◆                  ◆◆◆     ◆     ◆  ◆    ◆   ♥︎♥︎
 ♥︎♥︎ 　    ◆ ◆   ◆ ◆ ◆◆◆   ◆◆◆ ◆   ◆   ◆◆  ◆         ◆   ◆◆◆◆◆◆◆◆◆ ◆   ◆◆◆◆◆◆◆                   ◆◆◆     ◆ ◆   ◆◆    ♥︎♥︎
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 ♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎♥︎
 */

#import <UIKit/UIKit.h>

typedef void (^Is_A_Block) (NSString *name);


@interface ZSC_SecondVC : UIViewController

/**
 *  @author 很傻很天真, 16-08-19 13:08:44
 *
 *  第一种方式：生成block类型的属性
 *
 *  @since ZSC
 */
@property (nonatomic , copy) void(^DearBlock)(NSString *name);

/**
 *  @author 很傻很天真, 16-08-19 13:08:29
 *
 *  第二种方式：生成block属性
 *
 *  @since ZSC
 */
@property (nonatomic, copy) Is_A_Block dear_block;


@end
